{
  "vocab": [
    "<pad>",
    "<bos>",
    "<eos>",
    "#",
    "%10",
    "%11",
    "(",
    ")",
    "-",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    "=",
    "B",
    "Br",
    "C",
    "Cl",
    "F",
    "I",
    "N",
    "O",
    "P",
    "S",
    "[B-]",
    "[BH-]",
    "[BH2-]",
    "[BH3-]",
    "[B]",
    "[Br+2]",
    "[Br-]",
    "[C+]",
    "[C-]",
    "[CH+]",
    "[CH-]",
    "[CH2+]",
    "[CH2]",
    "[CH]",
    "[Cl+2]",
    "[Cl+3]",
    "[Cl+]",
    "[Cl-]",
    "[F+]",
    "[F-]",
    "[I+2]",
    "[I+3]",
    "[I+]",
    "[IH2]",
    "[N+]",
    "[N-]",
    "[NH+]",
    "[NH-]",
    "[NH2+]",
    "[NH3+]",
    "[N]",
    "[O+]",
    "[O-]",
    "[OH+]",
    "[O]",
    "[P+]",
    "[P-]",
    "[PH2+]",
    "[PH]",
    "[S+]",
    "[S-]",
    "[SH]",
    "[Se+]",
    "[Se-]",
    "[SeH2]",
    "[SeH]",
    "[Se]",
    "[Si-]",
    "[SiH-]",
    "[SiH2]",
    "[SiH]",
    "[Si]",
    "[c+]",
    "[c-]",
    "[cH+]",
    "[cH-]",
    "[n+]",
    "[n-]",
    "[nH+]",
    "[nH]",
    "[o+]",
    "[s+]",
    "[se+]",
    "[se]",
    "b",
    "c",
    "n",
    "o",
    "p",
    "s"
  ],
  "token_to_id": {
    "<pad>": 0,
    "<bos>": 1,
    "<eos>": 2,
    "#": 3,
    "%10": 4,
    "%11": 5,
    "(": 6,
    ")": 7,
    "-": 8,
    "1": 9,
    "2": 10,
    "3": 11,
    "4": 12,
    "5": 13,
    "6": 14,
    "7": 15,
    "8": 16,
    "9": 17,
    "=": 18,
    "B": 19,
    "Br": 20,
    "C": 21,
    "Cl": 22,
    "F": 23,
    "I": 24,
    "N": 25,
    "O": 26,
    "P": 27,
    "S": 28,
    "[B-]": 29,
    "[BH-]": 30,
    "[BH2-]": 31,
    "[BH3-]": 32,
    "[B]": 33,
    "[Br+2]": 34,
    "[Br-]": 35,
    "[C+]": 36,
    "[C-]": 37,
    "[CH+]": 38,
    "[CH-]": 39,
    "[CH2+]": 40,
    "[CH2]": 41,
    "[CH]": 42,
    "[Cl+2]": 43,
    "[Cl+3]": 44,
    "[Cl+]": 45,
    "[Cl-]": 46,
    "[F+]": 47,
    "[F-]": 48,
    "[I+2]": 49,
    "[I+3]": 50,
    "[I+]": 51,
    "[IH2]": 52,
    "[N+]": 53,
    "[N-]": 54,
    "[NH+]": 55,
    "[NH-]": 56,
    "[NH2+]": 57,
    "[NH3+]": 58,
    "[N]": 59,
    "[O+]": 60,
    "[O-]": 61,
    "[OH+]": 62,
    "[O]": 63,
    "[P+]": 64,
    "[P-]": 65,
    "[PH2+]": 66,
    "[PH]": 67,
    "[S+]": 68,
    "[S-]": 69,
    "[SH]": 70,
    "[Se+]": 71,
    "[Se-]": 72,
    "[SeH2]": 73,
    "[SeH]": 74,
    "[Se]": 75,
    "[Si-]": 76,
    "[SiH-]": 77,
    "[SiH2]": 78,
    "[SiH]": 79,
    "[Si]": 80,
    "[c+]": 81,
    "[c-]": 82,
    "[cH+]": 83,
    "[cH-]": 84,
    "[n+]": 85,
    "[n-]": 86,
    "[nH+]": 87,
    "[nH]": 88,
    "[o+]": 89,
    "[s+]": 90,
    "[se+]": 91,
    "[se]": 92,
    "b": 93,
    "c": 94,
    "n": 95,
    "o": 96,
    "p": 97,
    "s": 98
  },
  "id_to_token": {
    "0": "<pad>",
    "1": "<bos>",
    "2": "<eos>",
    "3": "#",
    "4": "%10",
    "5": "%11",
    "6": "(",
    "7": ")",
    "8": "-",
    "9": "1",
    "10": "2",
    "11": "3",
    "12": "4",
    "13": "5",
    "14": "6",
    "15": "7",
    "16": "8",
    "17": "9",
    "18": "=",
    "19": "B",
    "20": "Br",
    "21": "C",
    "22": "Cl",
    "23": "F",
    "24": "I",
    "25": "N",
    "26": "O",
    "27": "P",
    "28": "S",
    "29": "[B-]",
    "30": "[BH-]",
    "31": "[BH2-]",
    "32": "[BH3-]",
    "33": "[B]",
    "34": "[Br+2]",
    "35": "[Br-]",
    "36": "[C+]",
    "37": "[C-]",
    "38": "[CH+]",
    "39": "[CH-]",
    "40": "[CH2+]",
    "41": "[CH2]",
    "42": "[CH]",
    "43": "[Cl+2]",
    "44": "[Cl+3]",
    "45": "[Cl+]",
    "46": "[Cl-]",
    "47": "[F+]",
    "48": "[F-]",
    "49": "[I+2]",
    "50": "[I+3]",
    "51": "[I+]",
    "52": "[IH2]",
    "53": "[N+]",
    "54": "[N-]",
    "55": "[NH+]",
    "56": "[NH-]",
    "57": "[NH2+]",
    "58": "[NH3+]",
    "59": "[N]",
    "60": "[O+]",
    "61": "[O-]",
    "62": "[OH+]",
    "63": "[O]",
    "64": "[P+]",
    "65": "[P-]",
    "66": "[PH2+]",
    "67": "[PH]",
    "68": "[S+]",
    "69": "[S-]",
    "70": "[SH]",
    "71": "[Se+]",
    "72": "[Se-]",
    "73": "[SeH2]",
    "74": "[SeH]",
    "75": "[Se]",
    "76": "[Si-]",
    "77": "[SiH-]",
    "78": "[SiH2]",
    "79": "[SiH]",
    "80": "[Si]",
    "81": "[c+]",
    "82": "[c-]",
    "83": "[cH+]",
    "84": "[cH-]",
    "85": "[n+]",
    "86": "[n-]",
    "87": "[nH+]",
    "88": "[nH]",
    "89": "[o+]",
    "90": "[s+]",
    "91": "[se+]",
    "92": "[se]",
    "93": "b",
    "94": "c",
    "95": "n",
    "96": "o",
    "97": "p",
    "98": "s"
  }
}